##Introduction to SQL and Advanced Functions Assignment

Q.1 Explain the fundamental differences between DDL, DML, and DQL
commands in SQL. Provide one example for each type of command.

-->

1.DDL – Data Definition Language

Purpose:
DDL commands are used to define, create, modify, or delete the structure of database objects like tables, views, schemas, indexes, etc.

Key Features:

Affects the schema (structure) of the database.

Changes are usually auto-committed (cannot be rolled back in many DB systems).

Common DDL Commands: CREATE, ALTER, DROP, TRUNCATE

In [ ]:
CREATE TABLE Students (
    StudentID INT PRIMARY KEY,
    Name VARCHAR(50),
    Age INT
);

2.DML – Data Manipulation Language

Purpose:
DML commands are used to manipulate data inside tables, i.e., insert, update, delete, or modify the data stored.

Key Features:

Affects the data, not the structure.

Changes can be rolled back (transaction-controlled).

Common DML Commands: INSERT, UPDATE, DELETE

In [ ]:
INSERT INTO Students (StudentID, Name, Age)
VALUES (1, 'Rahul', 20);

3.DQL – Data Query Language

Purpose:
DQL commands are used to query and fetch data from the database.

Key Features:

Does not modify data.

Only retrieves information based on conditions.

Common DQL Command: SELECT

In [ ]:
SELECT Name, Age
FROM Students
WHERE Age > 18;

Q.2 What is the purpose of SQL constraints? Name and describe three common types
of constraints, providing a simple scenario where each would be useful.

--> SQL constraints are rules applied to table columns to ensure the accuracy, consistency, and reliability of the data in a database.
They help prevent invalid data from being entered.

Three Common Types of SQL Constraints (with Use Cases)
1.PRIMARY KEY
Purpose:

Uniquely identifies each row in a table.
A primary key must be unique and NOT NULL.

Scenario:

In a Students table, each student must have a unique ID.

In [ ]:
CREATE TABLE Students (
    StudentID INT PRIMARY KEY,
    Name VARCHAR(50),
    Age INT
);

2.FOREIGN KEY
Purpose:

Maintains referential integrity by linking two tables.
A foreign key ensures that a value exists in the referenced table.

Scenario:

You have a Students table and a Courses table.
To record which student is enrolled in which course:

In [ ]:
FOREIGN KEY
Purpose:

Maintains referential integrity by linking two tables.
A foreign key ensures that a value exists in the referenced table.

Scenario:

You have a Students table and a Courses table.
To record which student is enrolled in which course:

3.UNIQUE Constraint
Purpose:

Ensures all values in a column are different (but allows NULL unless specified otherwise).

Scenario:

In a Users table, each user must have a unique email.

In [ ]:
CREATE TABLE Users (
    UserID INT PRIMARY KEY,
    Email VARCHAR(100) UNIQUE,
    Password VARCHAR(50)
);

Q.3 Explain the difference between LIMIT and OFFSET clauses in SQL. How
would you use them together to retrieve the third page of results, assuming each page
has 10 records?

-->
Difference Between LIMIT and OFFSET in SQL

LIMIT

Specifies how many rows to return.

Example:

In [ ]:
LIMIT 10

OFFSET

Specifies how many rows to skip before starting to return rows.

Example:

In [ ]:
OFFSET 20

Using LIMIT and OFFSET Together

They are commonly used for pagination.

Goal:

Retrieve the 3rd page of results, with 10 records per page.

Formula for OFFSET:

OFFSET=(page number−1)×records per page

So for page 3 with 10 records per page:

(3−1)×10=20

In [ ]:
SELECT *
FROM your_table
LIMIT 10 OFFSET 20;

Q.4 What is a Common Table Expression (CTE) in SQL, and what are its main
benefits? Provide a simple SQL example demonstrating its usage

-->

A Common Table Expression (CTE) is a temporary, named result set that you can reference within a single SQL query.
It is created using the WITH keyword.

Think of a CTE as a virtual table that exists only for the duration of the query.

Benefits of a CTE
1.Improves Readability

Makes complex queries easier to understand by breaking them into logical parts.

2.Avoids Repetition

Allows you to reuse the CTE result multiple times in the main query.

3.Supports Recursion

Helpful for hierarchical data (e.g., employees, category trees).

4.Easier to Maintain

Modifying a CTE is simpler than editing multiple nested subqueries.

Example of a CTE


Find students older than the average age.

In [ ]:
WITH AvgAge AS (
    SELECT AVG(Age) AS average_age
    FROM Students
)
SELECT Name, Age
FROM Students, AvgAge
WHERE Students.Age > AvgAge.average_age;

Q.5 Describe the concept of SQL Normalization and its primary goals. Briefly
explain the first three normal forms (1NF, 2NF, 3NF).

--> SQL Normalization is the process of organizing data in a database to reduce redundancy and improve data integrity.

It involves breaking large, unstructured tables into smaller, well-structured ones and defining relationships between them.

Primary Goals of Normalization

 - Eliminate redundant (duplicate) data

 - Ensure logical data storage

 - Avoid update, insert, and delete anomalies

 - Improve data integrity and consistency

First Normal Form (1NF)
Definition:

A table is in 1NF if:

All columns contain atomic (indivisible) values

No repeating groups or multiple values in one cell

Each record is unique

Example:
Not 1NF:

In [ ]:
StudentID | Name   | Subjects
1         | Riya   | Math, Science

Convert to 1NF:

In [ ]:
StudentID | Name | Subject
1         | Riya | Math
1         | Riya | Science

Second Normal Form (2NF)
Definition:

A table is in 2NF if:

It is already in 1NF

All non-key attributes depend on the entire primary key, not part of it
(applies only when primary key is composite)

Problem Example (Partial Dependency):

In [ ]:
StudentID | CourseID | StudentName
1         | 101      | Riya

Convert to 2NF:

Split into two tables:

1.Student table

2.Enrollment table

Third Normal Form (3NF)
Definition:

A table is in 3NF if:

It is already in 2NF

No transitive dependency (non-key columns should not depend on other non-key columns)

Problem Example:

In [ ]:
EmployeeID | EmployeeName | DeptID | DeptName

Convert to 3NF:

 Split tables:

 - Employee(EmployeeID, EmployeeName, DeptID)

 - Department(DeptID, DeptName)

Q.6 Create a database named ECommerceDB and perform the following
tasks:
1.Create the following tables with appropriate data types and constraints:

● Categories

○ CategoryID (INT, PRIMARY KEY)

○ CategoryName (VARCHAR(50), NOT NULL, UNIQUE)

● Products

○ ProductID (INT, PRIMARY KEY)

○ ProductName (VARCHAR(100), NOT NULL, UNIQUE)

○ CategoryID (INT, FOREIGN KEY → Categories)

○ Price (DECIMAL(10,2), NOT NULL)

○ StockQuantity (INT)

● Customers

○ CustomerID (INT, PRIMARY KEY)

○ CustomerName (VARCHAR(100), NOT NULL)

○ Email (VARCHAR(100), UNIQUE)

○ JoinDate (DATE)

● Orders

○ OrderID (INT, PRIMARY KEY)

○ CustomerID (INT, FOREIGN KEY → Customers)

○ OrderDate (DATE, NOT NULL)

○ TotalAmount (DECIMAL(10,2))

In [ ]:
#1)Create tables

CREATE TABLE Categories (
    CategoryID INT PRIMARY KEY,
    CategoryName VARCHAR(50) NOT NULL UNIQUE
);

CREATE TABLE Products (
    ProductID INT PRIMARY KEY,
    ProductName VARCHAR(100) NOT NULL UNIQUE,
    CategoryID INT,
    Price DECIMAL(10,2) NOT NULL CHECK (Price >= 0),
    StockQuantity INT CHECK (StockQuantity >= 0),
    CONSTRAINT fk_products_category FOREIGN KEY (CategoryID)
        REFERENCES Categories(CategoryID)
        ON UPDATE CASCADE
        ON DELETE SET NULL
);

CREATE TABLE Customers (
    CustomerID INT PRIMARY KEY,
    CustomerName VARCHAR(100) NOT NULL,
    Email VARCHAR(100) UNIQUE,
    JoinDate DATE
);

CREATE TABLE Orders (
    OrderID INT PRIMARY KEY,
    CustomerID INT,
    OrderDate DATE NOT NULL,
    TotalAmount DECIMAL(10,2) CHECK (TotalAmount >= 0),
    CONSTRAINT fk_orders_customer FOREIGN KEY (CustomerID)
        REFERENCES Customers(CustomerID)
        ON UPDATE CASCADE
        ON DELETE SET NULL
);

 #2) Insert data into Categories

INSERT INTO Categories (CategoryID, CategoryName) VALUES
(1, 'Electronics'),
(2, 'Books'),
(3, 'Home Goods'),
(4, 'Apparel');

#3) Insert data into Products

INSERT INTO Products (ProductID, ProductName, CategoryID, Price, StockQuantity) VALUES
(101, 'Laptop Pro', 1, 1200.00, 50),
(102, 'SQL Handbook', 2, 45.50, 200),
(103, 'Smart Speaker', 1, 99.99, 150),
(104, 'Coffee Maker', 3, 75.00, 80),
(105, 'Novel: The Great SQL', 2, 25.00, 120),
(106, 'Wireless Earbuds', 1, 150.00, 100),
(107, 'Blender X', 3, 120.00, 60),
(108, 'T-Shirt Casual', 4, 20.00, 300);

#4) Insert data into Customers

INSERT INTO Customers (CustomerID, CustomerName, Email, JoinDate) VALUES
(1, 'Alice Wonderland', 'alice@example.com', '2023-01-10'),
(2, 'Bob the Builder', 'bob@example.com', '2022-11-25'),
(3, 'Charlie Chaplin', 'charlie@example.com', '2023-03-01'),
(4, 'Diana Prince', 'diana@example.com', '2021-04-26');

#5) Insert data into Orders

INSERT INTO Orders (OrderID, CustomerID, OrderDate, TotalAmount) VALUES
(1001, 1, '2023-04-26', 1245.50),
(1002, 2, '2023-10-12', 99.99),
(1003, 1, '2023-07-01', 145.00),
(1004, 3, '2023-01-14', 150.00),
(1005, 2, '2023-09-24', 120.00),
(1006, 1, '2023-06-19', 20.00);

Q.7 Generate a report showing CustomerName, Email, and the
TotalNumberofOrders for each customer. Include customers who have not placed
any orders, in which case their TotalNumberofOrders should be 0. Order the results
by CustomerName.

In [ ]:
SELECT
    c.CustomerName,
    c.Email,
    COUNT(o.OrderID) AS TotalNumberOfOrders
FROM
    Customers c
LEFT JOIN
    Orders o ON c.CustomerID = o.CustomerID
GROUP BY
    c.CustomerID, c.CustomerName, c.Email
ORDER BY
    c.CustomerName;

Q.8 Retrieve Product Information with Category: Write a SQL query to
display the ProductName, Price, StockQuantity, and CategoryName for all
products. Order the results by CategoryName and then ProductName alphabetically.

In [ ]:
SELECT
    p.ProductName,
    p.Price,
    p.StockQuantity,
    c.CategoryName
FROM
    Products p
JOIN
    Categories c ON p.CategoryID = c.CategoryID
ORDER BY
    c.CategoryName ASC,
    p.ProductName ASC;

Q.9 Write a SQL query that uses a Common Table Expression (CTE) and a
Window Function (specifically ROW_NUMBER() or RANK()) to display the
CategoryName, ProductName, and Price for the top 2 most expensive products in
each CategoryName.

In [ ]:
WITH RankedProducts AS (
    SELECT
        c.CategoryName,
        p.ProductName,
        p.Price,
        ROW_NUMBER() OVER (
            PARTITION BY p.CategoryID
            ORDER BY p.Price DESC
        ) AS rn
    FROM
        Products p
    JOIN
        Categories c ON p.CategoryID = c.CategoryID
)
SELECT
    CategoryName,
    ProductName,
    Price
FROM
    RankedProducts
WHERE
    rn <= 2
ORDER BY
    CategoryName,
    Price DESC;

Q.10 You are hired as a data analyst by Sakila Video Rentals, a global movie
rental company. The management team is looking to improve decision-making by
analyzing existing customer, rental, and inventory data.

Using the Sakila database, answer the following business questions to support key strategic
initiatives.

Tasks & Questions:

1.Identify the top 5 customers based on the total amount they’ve spent. Include customer
name, email, and total amount spent.

2.Which 3 movie categories have the highest rental counts? Display the category name
and number of times movies from that category were rented.

3.Calculate how many films are available at each store and how many of those have
never been rented.

4.Show the total revenue per month for the year 2023 to analyze business seasonality.

5.Identify customers who have rented more than 10 times in the last 6 months.

In [ ]:
# Top 5 customers based on total amount spent
SELECT
    c.first_name AS CustomerFirstName,
    c.last_name AS CustomerLastName,
    c.email,
    SUM(p.amount) AS TotalAmountSpent
FROM customer c
JOIN payment p ON c.customer_id = p.customer_id
GROUP BY c.customer_id, c.first_name, c.last_name, c.email
ORDER BY TotalAmountSpent DESC
LIMIT 5;

# Top 3 movie categories with highest rental counts
SELECT
    cat.name AS CategoryName,
    COUNT(*) AS RentalCount
FROM rental r
JOIN inventory i ON r.inventory_id = i.inventory_id
JOIN film_category fc ON i.film_id = fc.film_id
JOIN category cat ON fc.category_id = cat.category_id
GROUP BY cat.category_id, cat.name
ORDER BY RentalCount DESC
LIMIT 3;

# Films available at each store + how many have NEVER been rented
SELECT
    s.store_id,
    COUNT(i.inventory_id) AS TotalFilms,
    SUM(
        CASE
            WHEN r.rental_id IS NULL THEN 1
            ELSE 0
        END
    ) AS NeverRentedFilms
FROM store s
JOIN inventory i ON s.store_id = i.store_id
LEFT JOIN rental r ON i.inventory_id = r.inventory_id
GROUP BY s.store_id;

# Total revenue per month for the year 20234. Total revenue per month for the year 2023
SELECT
    DATE_FORMAT(payment_date, '%Y-%m') AS Month,
    SUM(amount) AS TotalRevenue
FROM payment
WHERE YEAR(payment_date) = 2023
GROUP BY DATE_FORMAT(payment_date, '%Y-%m')
ORDER BY Month;

# Customers who rented more than 10 times in the last 6 months
SELECT
    c.customer_id,
    c.first_name,
    c.last_name,
    COUNT(r.rental_id) AS TotalRentalsLast6Months
FROM customer c
JOIN rental r ON c.customer_id = r.customer_id
WHERE r.rental_date >= DATE_SUB(CURDATE(), INTERVAL 6 MONTH)
GROUP BY c.customer_id, c.first_name, c.last_name
HAVING COUNT(r.rental_id) > 10
ORDER BY TotalRentalsLast6Months DESC;